frontend/views/people/_form.php

SELECT * FROM `lookup_district` WHERE `state_id` IS NULL
SELECT * FROM `lookup_sub_base` WHERE `district_id` IS NULL
SELECT * FROM `lookup_cluster` WHERE `sub_base_id` IS NULL
SELECT * FROM `lookup_kampung` WHERE `cluster_id` IS NULL
SELECT * FROM `lookup_agama`
SELECT * FROM `lookup_bangsa`
SELECT * FROM `lookup_kategori_oku`
SELECT * FROM `lookup_perkahwinan`
SELECT * FROM `lookup_spending`
SELECT * FROM `lookup_income`
SELECT * FROM `lookup_edu_level`
SELECT * FROM `lookup_hubungan`
SELECT * FROM `lookup_edu_level_under_17`
---

//$negara = ArrayHelper::map(LookupCountry::find()->asArray()->all(), 'country_id', 'country');
$state = ArrayHelper::map(LookupState::find()->where(['kawasan_perlaksanaan'=>'Ya'])->asArray()->all(), 'state_id', 'state');
$district = ArrayHelper::map(LookupDistrict::find()->where(['state_id'=>$model->state_id])->asArray()->all(), 'district_id', 'district');
$district_sarawak = ArrayHelper::map(LookupDistrict::find()->where(['bahagian_id'=>$model->bahagian_id])->asArray()->all(), 'district_id', 'district');

$subbase = ArrayHelper::map(LookupSubBase::find()->where(['district_id'=>$model->district_id])->asArray()->all(),'sub_base_id','sub_base');
$cluster = ArrayHelper::map(LookupCluster::find()->where(['sub_base_id'=>$model->sub_base_id])->asArray()->all(),'cluster_id','cluster');
$kampung = ArrayHelper::map(LookupKampung::find()->where(['cluster_id'=>$model->cluster_id])->asArray()->all(),'kampung_id','kampung');
$mukim = ArrayHelper::map(LookupMukim::find()->where(['district_id'=>$model->district_id])->asArray()->all(),'mukim_id','mukim');
$bahagian = ArrayHelper::map(LookupBahagian::find()->where(['state_id'=>$model->state_id])->asArray()->all(), 'bahagian_id', 'bahagian');

$agama = ArrayHelper::map(LookupAgama::find()->asArray()->all(), 'id', 'agama');
$bangsa = ArrayHelper::map(LookupBangsa::find()->asArray()->all(), 'id', 'bangsa');
$kategoriOku = ArrayHelper::map(LookupKategoriOku::find()->asArray()->all(), 'id', 'kategori_oku');
$perkahwinan = ArrayHelper::map(LookupPerkahwinan::find()->asArray()->all(), 'id', 'status_perkahwinan');
$spending = ArrayHelper::map(LookupSpending::find()->asArray()->all(), 'id', 'spending');
$income = ArrayHelper::map(LookupIncome::find()->asArray()->all(), 'id', 'income');
$edu = ArrayHelper::map(LookupEduLevel::find()->asArray()->all(), 'id', 'edu_level');
$hubungan = ArrayHelper::map(LookupHubungan::find()->asArray()->all(), 'id', 'hubungan');
$edu17 = ArrayHelper::map(LookupEduLevelUnder17::find()->asArray()->all(), 'id', 'edu_level_under_17');